[
  {
    "id": "01",
    "title": "Software Engineer",
    "company_name": "Acme Corp",
    "company_logo": "https://example.com/acme_logo.png",
    "job_type": ["Full-time", "Remote"],
    "location": "San Francisco, CA",
    "salary": "$100,000 - $120,000 per year",
    "description": "Acme Corp is seeking a talented software engineer to join our team and work on developing cutting-edge software applications for our customers. The successful candidate will have a passion for software development and a desire to work in a fast-paced, dynamic environment.",
    "responsibility": "Design, develop, and maintain software applications using a variety of programming languages and technologies. Collaborate with other team members to identify and solve complex technical problems. Participate in code reviews and contribute to the continuous improvement of our software development processes.",
    "educational_requirement": "Bachelor's degree in Computer Science, Computer Engineering, or related field",
    "experience": "5+ years of experience in software engineering, with a focus on developing large-scale, enterprise-level applications",
    "contact_info": {
      "phone": "555-555-1234",
      "email": "careers@acmecorp.com"
    }
  },
  {
    "id": "02",
    "title": "Marketing Manager",
    "company_name": "Globex Corporation",
    "company_logo": "https://example.com/globex_logo.png",
    "job_type": ["Full-time", "Onsite"],
    "location": "New York, NY",
    "salary": "$80,000 - $100,000 per year",
    "description": "Globex Corporation is seeking an experienced marketing manager to develop and implement marketing strategies to promote our products and services to our customers. The successful candidate will have a strong background in marketing and a proven track record of success in developing and executing marketing campaigns.",
    "responsibility": "Develop and implement marketing strategies to promote Globex's products and services. Work with cross-functional teams to create marketing materials and campaigns that align with our brand and business objectives. Analyze marketing data and metrics to measure the effectiveness of marketing campaigns and identify areas for improvement.",
    "educational_requirement": "Bachelor's degree in Marketing, Business Administration, or related field",
    "experience": "7+ years of experience in marketing, with a focus on developing and executing marketing campaigns",
    "contact_info": {
      "phone": "555-555-5678",
      "email": "careers@globexcorp.com"
    }
  },
  {
    "id": "03",
    "title": "Mechanical Engineer",
    "company_name": "Tesla",
    "company_logo": "https://example.com/tesla_logo.png",
    "job_type": ["Part-time", "Onsite"],
    "location": "Fremont, CA",
    "salary": "$50 - $75 per hour",
    "description": "Tesla is seeking a talented Mechanical Engineer to join our team on a part-time, onsite basis and work on designing and developing mechanical systems for our vehicles. The successful candidate will have a strong background in mechanical engineering, experience working with CAD software, and a passion for sustainable transportation.",
    "responsibility": "Design and develop mechanical systems for Tesla vehicles, including component selection, system integration, and design verification. Collaborate with other team members to identify and solve technical challenges related to mechanical design and manufacturing. Continuously evaluate and improve the performance of mechanical systems and components.",
    "educational_requirement": "Bachelor's or Master's degree in Mechanical Engineering or related field",
    "experience": "3+ years of experience in mechanical engineering, with a focus on designing and developing mechanical systems for automotive or aerospace applications",
    "contact_info": {
      "phone": "555-555-6789",
      "email": "careers@tesla.com"
    }
  },
  {
    "id": "04",
    "title": "Software Engineer",
    "company_name": "Google",
    "company_logo": "https://example.com/google_logo.png",
    "job_type": ["Full-time", "Onsite"],
    "location": "Mountain View, CA",
    "salary": "$150,000 - $200,000 per year",
    "description": "Google is seeking a highly skilled software engineer to join our team and work on developing innovative software products that will have a positive impact on people's lives. The successful candidate will have a passion for software development, strong problem-solving skills, and a desire to work in a collaborative environment.",
    "responsibility": "Design, develop, and maintain software applications and systems that meet Google's high standards for quality and performance. Collaborate with other team members to identify and solve complex technical problems. Participate in code reviews and contribute to the continuous improvement of our software development processes.",
    "educational_requirement": "Bachelor's degree in Computer Science, Computer Engineering, or related field",
    "experience": "8+ years of experience in software engineering, with a focus on developing large-scale, highly available, and fault-tolerant distributed systems",
    "contact_info": {
      "phone": "555-555-5678",
      "email": "careers@google.com"
    }
  },
  {
    "id": "05",
    "title": "Product Manager",
    "company_name": "Apple",
    "company_logo": "https://example.com/apple_logo.png",
    "job_type": ["Full-time", "Remote"],
    "location": "Remote",
    "salary": "$140,000 - $180,000 per year",
    "description": "Apple is seeking a talented product manager to join our team and work on developing groundbreaking products that will shape the future of technology. The successful candidate will have a passion for product development, a deep understanding of customer needs, and a desire to work in a fast-paced, dynamic environment.",
    "responsibility": "Lead the product development process from ideation to launch, working closely with cross-functional teams including engineering, design, marketing, and operations. Define and communicate product strategy and roadmaps to internal stakeholders and external partners. Conduct market research and analysis to identify customer needs and opportunities for innovation.",
    "educational_requirement": "Bachelor's degree in Business Administration, Engineering, or related field; MBA preferred",
    "experience": "7+ years of experience in product management, with a proven track record of successfully launching products in a fast-paced, dynamic environment",
    "contact_info": {
      "phone": "555-555-9012",
      "email": "careers@apple.com"
    }
  },
  {
    "id": "06",
    "title": "UX Designer",
    "company_name": "Facebook",
    "company_logo": "https://example.com/facebook_logo.png",
    "job_type": ["Part-time", "Onsite"],
    "location": "Menlo Park, CA",
    "salary": "$50 - $75 per hour",
    "description": "Facebook is seeking a talented UX Designer to join our team on a part-time basis and work on designing intuitive and engaging user experiences for our products. The successful candidate will have a passion for user-centered design, strong problem-solving skills, and a desire to work in a collaborative environment.",
    "responsibility": "Collaborate with cross-functional teams including product managers, engineers, and researchers to design user experiences that meet the needs of our users. Conduct user research and usability testing to validate design decisions. Create wireframes, prototypes, and other design artifacts to communicate design concepts to stakeholders.",
    "educational_requirement": "Bachelor's degree in Design, Human-Computer Interaction, or related field",
    "experience": "3+ years of experience in UX design, with a portfolio showcasing your design process and problem-solving skills",
    "contact_info": {
      "phone": "555-555-3456",
      "email": "careers@facebook.com"
    }
  },
  {
    "id": "07",
    "title": "Artificial Intelligence Engineer",
    "company_name": "IBM",
    "company_logo": "https://example.com/ibm_logo.png",
    "job_type": ["Part-time", "Remote"],
    "location": "Remote",
    "salary": "$75 - $100 per hour",
    "description": "IBM is seeking a talented Artificial Intelligence Engineer to join our team on a part-time, remote basis and work on developing cutting-edge AI technologies for our clients. The successful candidate will have a strong background in AI and machine learning, experience working with large datasets, and a desire to work in a fast-paced, dynamic environment.",
    "responsibility": "Develop and implement AI algorithms and models to solve complex business problems. Collaborate with other team members to identify and solve technical challenges related to data processing, model training, and performance optimization. Continuously monitor and evaluate the performance of AI models and make improvements as needed.",
    "educational_requirement": "Master's or PhD in Computer Science, Artificial Intelligence, or related field",
    "experience": "5+ years of experience in AI engineering, with a focus on developing and implementing AI models for real-world applications",
    "contact_info": {
      "phone": "555-555-5678",
      "email": "careers@ibm.com"
    }
  },
  {
    "id": "08",
    "title": "Software Engineer, Backend",
    "company_name": "Uber",
    "company_logo": "https://example.com/uber_logo.png",
    "job_type": ["Part-time", "Remote"],
    "location": "Remote",
    "salary": "$50 - $75 per hour",
    "description": "Uber is seeking a talented Backend Software Engineer to join our team on a part-time, remote basis and work on developing and scaling our backend systems. The successful candidate will have experience with distributed systems, strong coding skills in languages like Java or Go, and a passion for building high-performance and reliable systems.",
    "responsibility": "Design and develop highly scalable and fault-tolerant backend systems to support Uber's services. Work with other teams to identify requirements and build APIs that enable fast and reliable access to data. Monitor and troubleshoot production systems to ensure high availability and performance.",
    "educational_requirement": "Bachelor's or Master's degree in Computer Science or related field",
    "experience": "3+ years of experience in software engineering, with a focus on backend development and distributed systems",
    "contact_info": {
      "phone": "555-555-1212",
      "email": "careers@uber.com"
    }
  }
]
